name: "detector"
platform: "onnxruntime_onnx"
max_batch_size: 8
input [
  {
    name: "images"
    data_type: TYPE_FP32
    dims: [ 3, 640, 640 ]
  }
]
output [
  {
    name: "output0"
    data_type: TYPE_FP32
    dims: [ 7, -1 ]
  }
]
dynamic_batching {
  preferred_batch_size: [ 1, 4, 8 ]
  max_queue_delay_microseconds: 1000
}
instance_group [
  {
    kind: KIND_CPU
    count: 1
  }
]
version_policy: { specific: { versions: [1] } }
